Revit 2027 API
FormulaEditingEventArgs.Formula Property
 Returns text of the formula that will be modified
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string Formula { get; }
Public ReadOnly Property Formula As String
	Get
public:
property String^ Formula {
	String^ get ();
}
member Formula : string with get
Property Value
String
See Also
Reference
FormulaEditingEventArgs Class
Autodesk.Revit.UI.Events Namespace